# -*- coding: utf-8 -*-
"""
Сохранение данных в файле
Автор: Поляков К. Л.
"""
# Тестовая база
def base():
    """
    Учебная база кинотеатра
    Входных параметров нет
    Автор: Васильев Р. И. Вдовин С.В
    """
    fields = ["ID пользователя", "Имя пользователя", "E-mail пользователя", "Наличие Подписки", "ID фильма"
        , "Название Фильма","ID режиссера","Режиссер","Жанр","Оценка","Время Просмотра"]
    surname = ["Иванов", "Сидоров"]
    Иванов = ["1", "ivanovp", "ivanovp@mail.ru", "Да", "8","Криминальное Чтиво","5","Г.Ричи" ,"Боевик","5", "01:22:31"]
    Сидоров = ["1", "sidp", "sidp@mail.ru", "Да", "8","Криминальное Чтиво","5","Г.Ричи" ,"Боевик","0", "01:11:22"]

# Создаем список списков
    w1 = [Иванов, Сидоров]
# Создаем списко словарей
    w2 = [dict(zip(fields, x)) for x in w1]
# Создаем словарь словарей
    w3 = dict(zip(surname, w2))
    return w3
